import * as THREE from '../../libs/three137/three.module.js';

class CQBConfig{
    constructor(){
        // 每轮游戏每个任务点的文字提示
        this.text = {
            'scene1':{
                '1st':{
                    0:"您目前正在扮演1号士兵：突破口打开后，1号士兵应立刻进入房间，消灭任何发现的直接威胁，请击杀NPC A。按空格继续。",
                    1:"在清除直接威胁的同时，1号士兵应向右转，沿墙壁进行移动的同时清理房间右侧远端与角落的敌人，并抵达1号士兵控制点。请击杀NPC B。按空格继续。",
                    2:"您已到达1号士兵控制点，成功完成1号士兵的职责！按空格继续。"
                },
                '2nd':{
                    0:"您目前正在扮演2号士兵：突破口打开后，2号士兵紧随1号士兵移动，消灭任何可能残余的直接威胁，向1号士兵反方向前进的同时消灭房间左侧远端与角落的敌人。请击杀NPC C。按空格继续。",
                    1:"您已到达2号士兵控制点，成功完成2号士兵的职责！按空格继续。",
                },
                '3rd':{
                    0:"您目前正在扮演3号士兵：突破口打开后，3号士兵紧随2号移动，消灭任何可能残余的直接威胁，向1号士兵方向前进并清理房间远端与对角的敌人。请移动到下一个任务点。按空格继续。",
                    1:"您已到达3号士兵控制点，请击杀NPC E，完成3号士兵的职责。按空格继续。",
                },
                '4th':{
                    0:"您目前正在扮演4号士兵：突破口打开后，4号士兵紧随2号移动，消灭任何可能残余的直接威胁，向2号士兵方向前进并清理房间远端与对角的敌人。请移动到下一个任务点。按空格继续。",
                    1:"您已到达4号士兵控制点，请击杀NPC D，完成4号士兵的职责。按空格继续。",
                },
                'end':'强壁法运用训练结束，此时您的小队中：1、2号士兵移动至房间角落抵达控制点，3、4号士兵移动至距离突破口至少1m之外的位置，成功清理目标房间。您的数据已返回服务器，您可以随时离开该页面并在用户后台查看您的数据。按空格继续。',
            },
            'scene2':{
                '1st':{
                    0:"您目前正在扮演1号士兵：突破口打开后，1号士兵立刻进入目标房间，消灭任何发现的直接威胁，请击杀NPC A。同时，1号士兵应选择向左或右移动，通常选择阻力较小的一方。因本场景右侧障碍物较多，所以选择向左沿墙壁持续移动至第一个控制点，往往是房间角落或临近角落的位置。按空格继续。",
                    1:"您已抵达阻力较小的房间角落，此时视野内出现敌人，请击杀NPC B，并在向相反方向转身的同时继续向房间深处移动。按空格继续。",
                    2:"您已到达1号士兵控制点，成功完成1号士兵的职责！按空格继续。"
                },
                '2nd':{
                    0:"您目前正在扮演2号士兵：突破口打开后，2号士兵紧随1号士兵移动，和1号士兵先后进入目标房间，确保清理任何直接威胁，并确保清理突破口四周，请击杀NPC C。随后向1号士兵相反方向行进至第2控制点。按空格继续。",
                    1:"您已到达2号士兵控制点，成功完成2号士兵的职责！按空格继续。",
                },
                '3rd':{
                    0:"您目前正在扮演3号士兵：突破口打开后，3号士兵紧随2号移动，清理房间远端角落的敌人，请击杀NPC D。同时向2号士兵方向前进至少1m后抵达第3控制点。按空格继续。",
                    1:"您已到达3号士兵控制点，成功完成3号士兵的职责！按空格继续。",
                },
                '4th':{
                    0:"您目前正在扮演4号士兵：突破口打开后，4号士兵紧随2号移动，向1号士兵方向前进至少1m后抵达第4控制点。请移动到下一个任务点。按空格继续。",
                    1:"您已到达4号士兵控制点，成功完成4号士兵的职责！按空格继续。",
                },
                'end':'反角法运用训练结束，此时您的小队中：1、2号士兵移动至房间角落抵达控制点，3、4号士兵移动至距离突破口至少1m之外的位置，成功清理目标房间。您的数据已返回服务器，您可以随时离开该页面并在用户后台查看您的数据。按空格继续。',
            }
        };

        // 每轮游戏每个任务点的击杀目标（NPC的名字对应NPC数组里的下标）
        this.targets = {
            'scene1':{
                '1st':{
                    0:0,
                    1:1,
                },
                '2nd':{
                    0:2,
                },
                '3rd':{
                    0:undefined, // undefined 表示当前任务点不需要玩家击杀NPC
                    1:4,
                },
                '4th':{
                    0:undefined,
                    1:3,
                }
            },
            'scene2':{
                '1st':{
                    0:0,
                    1:1,
                },
                '2nd':{
                    0:2,
                },
                '3rd':{
                    0:3, 
                },
                '4th':{
                    0:undefined,
                }
            },
        }

        // 每轮游戏每个任务点的位置
        this.missionPoints = {
            'scene1':{
                '1st':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.019919834864126, 0.18245120346546173, 1.3124429261695632),
                    2:new THREE.Vector3(21.03893097433767, 0.18245120346546173, 5.955562077164792),
                },
                '2nd':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.179459028779196, 0.18245120346546173, -7.4913905647656875),
                },
                '3rd':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.170839316398546, 0.18245120346546173, 2.4469670985777),
                },
                '4th':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.15417638482961, 0.18245120346546173, -4.987210103242351),
                }
            },
            'scene2':{
                '1st':{
                    0:new THREE.Vector3( -8.533233360428644, 0.15837565296865996, -23.925610220279715),
                    1:new THREE.Vector3( -6.702931647073044, 0.18245120346546173, -28.30809706988011),
                    2:new THREE.Vector3( -0.1459891271519097, 0.18245120346546173, -28.796337969742154),
                },
                '2nd':{
                    0:new THREE.Vector3( -8.533233360428644, 0.15837565296865996, -23.925610220279715),
                    1:new THREE.Vector3( -2.1016586527604875, 0.18245120346546173, -16.762760231468995),
                },
                '3rd':{
                    0:new THREE.Vector3( -8.533233360428644, 0.15837565296865996, -23.925610220279715),
                    1:new THREE.Vector3( -5.955942447110394, 0.18245120346546173, -19.108709597321123),
                },
                '4th':{
                    0:new THREE.Vector3( -8.533233360428644, 0.15837565296865996, -23.925610220279715),
                    1:new THREE.Vector3( -6.2946320631328705, 0.18245120346546173, -28.28846708136502),
                }
            }
        };

        // 两个场景的玩家初始化位置
        this.startPosition = {
            'scene1':new THREE.Vector3(21, 0.186, 0),
            'scene2':new THREE.Vector3(-11.78609367674414, 0.13426758701522457, -23.89975828918036),
        };

        // 每轮NPC存活死亡情况（根据CQB），false代表存活，true代表死亡
        this.NPCstatus = {
            'scene1':{
                '1st':{
                    'A':false,
                    'B':false,
                    'C':false,
                    'D':false,
                    'E':false,
                },
                '2nd':{
                    'A':true,
                    'B':true,
                    'C':false,
                    'D':false,
                    'E':false,
                },
                '3rd':{
                    'A':true,
                    'B':true,
                    'C':true,
                    'D':false,
                    'E':false,
                },
                '4th':{
                    'A':true,
                    'B':true,
                    'C':true,
                    'D':false,
                    'E':true,
                }
            },
            'scene2':{
                '1st':{
                    'A':false,
                    'B':false,
                    'C':false,
                    'D':false,
                },
                '2nd':{
                    'A':true,
                    'B':true,
                    'C':false,
                    'D':false,
                },
                '3rd':{
                    'A':true,
                    'B':true,
                    'C':true,
                    'D':false,
                },
                '4th':{
                    'A':true,
                    'B':true,
                    'C':true,
                    'D':true,
                }
            }
        }

    }
}

export { CQBConfig };