import * as THREE from '../../libs/three137/three.module.js';

class CQBConfig{
    constructor(){
        this.text = {
            'scene1':{
                '1st':{
                    0:"prompt 1-1",
                    1:"prompt 1-2",
                    2:"prompt 1-3"
                },
                '2nd':{
                    0:"prompt 2-1",
                    1:"prompt 2-2",
                },
                '3rd':{
                    0:"prompt 3-1",
                    1:"prompt 3-2",
                },
                '4th':{
                    0:"prompt 4-1",
                    1:"prompt 4-2",
                }
            },
            'scene2':{
            },
            'end':'训练结束，您的数据已返回服务器，您可以随时离开该页面并在用户后台查看您的数据。\n按空格继续。',
        };

        this.missionPoints = {
            'scene1':{
                '1st':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.019919834864126, 0.18245120346546173, 1.3124429261695632),
                    2:new THREE.Vector3(21.03893097433767, 0.18245120346546173, 5.955562077164792),
                },
                '2nd':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.179459028779196, 0.18245120346546173, -7.4913905647656875),
                },
                '3rd':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.170839316398546, 0.18245120346546173, 2.4469670985777),
                },
                '4th':{
                    0:new THREE.Vector3( 21.950816950006, 0.2062275464428991, -1.132499337240025),
                    1:new THREE.Vector3(21.15417638482961, 0.18245120346546173, -4.987210103242351),
                }
            }
        };

        this.startPosition = {
            'scene1':new THREE.Vector3(21, 0.186, 0),
            'scene2':new THREE.Vector3(-5.7286011280456215, 0.015784740447998047, -7.691993105828407),
        };

    }
}

export { CQBConfig };